[
  {
    "title": "Why Grogu Was the Make That Rekindled My Crochet Joy",
    "slug": "grogu-crochet-joy",
    "date": "2025-01-01",
    "cover_image": "images/blog_grogu.jpg",
    "tags": ["amigurumi", "grogu", "star wars", "personal", "creativity", "pattern"],
    "content": "Have you ever picked up a project that reminded you why you started crocheting in the first place? For me, that was Grogu.\n\nI’d been in a tiny creative slump, hopping between projects, starting things and abandoning them halfway. But the moment I stitched those first 6 sc into a magic ring for Grogu’s head, something clicked. There’s something deeply calming about making a round little creature with big ears and a soft robe. You don’t just crochet Grogu — you summon him.\n\nWhen I finished stitching his tiny ears and finally attached his robe, I couldn’t help but smile. Suddenly I remembered why I love amigurumi: it gives personality to yarn.\n\nIf you want to try him yourself, I’ve included the full pattern in my collection. And if you do make him, PLEASE share a picture — I absolutely love seeing everyone’s versions.\n\nQuestion for you: What project helped you rediscover your creativity?"
  },
  {
    "title": "Meet Pig: The Squishiest, Happiest Make I’ve Ever Designed",
    "slug": "pig-squishy-amigurumi",
    "date": "2025-01-05",
    "cover_image": "images/blog_pig.jpg",
    "tags": ["amigurumi", "pig", "cute", "personal", "pattern", "farm"],
    "content": "This Pig pattern is one of those projects that look more complicated than they are. The moment you finish the snout, the whole character comes alive. You’ll see exactly what I mean when you make it — it’s instant personality.\n\nI stuffed mine a little extra to make it super round and huggable, and honestly? No regrets.\n\nThe funniest part was sewing the tail. I swear this piglet came out looking like it had opinions about everything I did. Every time I adjusted the placement, it seemed to glare at me like, 'Ma’am, that angle is UNHINGED.'\n\nWhen I finally got it right, I felt that little sense of victory only a crocheter knows.\n\nWant to meet Pig yourself? The pattern is included in my crochet database!\n\nTell me: Do you love extra-round stuffed amigurumi too? Or do you prefer lightly stuffed?"
  },
  {
    "title": "The Bat That Helped Me Embrace Spooky-Cute Season",
    "slug": "bat-spooky-cute-amigurumi",
    "date": "2025-01-10",
    "cover_image": "images/blog_bat.jpg",
    "tags": ["amigurumi", "bat", "halloween", "spooky-cute", "pattern", "seasonal"],
    "content": "This tiny bat might be one of my favorite amigurumi EVER.\n\nWhenever fall hits, I want to crochet everything spooky-cute — pumpkins, ghosts, black cats, the whole cozy spooky aesthetic. But this bat ended up being the star of my table.\n\nThe wings were the part that scared me at first, because they look fancy. But once I flattened the final round and started working the shaping, I caught myself thinking, 'Oh. That’s all? Why was I worried?'\n\nI crocheted two of them and hung them near my window. Now every sunset, the light catches the wings just right and they look ALIVE. Tiny shadow guardians.\n\nIf you want to bring a little spooky joy into your home, give this bat a try — the pattern is available in my collection!\n\nCommunity question: Should I design a vampire version next?"
  },
  {
    "title": "Bulbasaur Was My Childhood in Yarn Form",
    "slug": "bulbasaur-crochet-nostalgia",
    "date": "2025-01-14",
    "cover_image": "images/blog_bulbasaur.jpg",
    "tags": ["amigurumi", "pokemon", "bulbasaur", "nostalgia", "pattern"],
    "content": "Some patterns feel nostalgic the moment you start them.\n\nBulbasaur was that for me.\n\nI remember watching Pokémon as a kid and ALWAYS choosing Bulbasaur because: 1) He was cute, 2) He was loyal, 3) Vine Whip supremacy.\n\nCrocheting his body was surprisingly soothing, but the BEST part was shaping the bulb. When I cinched the top and wrapped the yarn around to create the little 'bulb bumps,' it instantly transported me back to childhood joy.\n\nI love how this pattern turns out — simple, sweet, and full of personality.\n\nPattern included in my database. Please make one and let me see your colors — I’m obsessed with alternate-color Bulbasaurs.\n\nWhat Pokémon should I crochet next?"
  },
  {
    "title": "Sheep: A Fluffy Experiment That Turned Into a Community Favorite",
    "slug": "sheep-crochet-bobble-stitch",
    "date": "2025-01-18",
    "cover_image": "images/blog_sheep.jpg",
    "tags": ["amigurumi", "sheep", "farm", "texture", "bobble Stitch", "pattern"],
    "content": "This sheep was my first real adventure into textured stitches.\n\nBobble rows? On the WRONG side? With a bigger hook? This pattern gave me homework.\n\nBut I promise you:\n✨ The texture payoff is REAL.\n✨ It looks way more complicated than it is.\n✨ Everyone who sees mine immediately goes “OMG can I squeeze it?”\n\nMy favorite part is that it looks homemade in the best possible way — soft, bobbly, and full of character.\n\nIf you’ve avoided texture in your amigurumi… this is your sign to give it a try! Pattern included in my master collection.\n\nEngage with me: What textured stitch should I try next? Popcorn? Puff? Something cursed?"
  },
  {
    "title": "Koya BT21: The Sleepy Friend Everyone Needs on Their Shelf",
    "slug": "koya-bt21-amigurumi",
    "date": "2025-01-21",
    "cover_image": "images/blog_koya.jpg",
    "tags": ["amigurumi", "bt21", "koya", "cute", "pattern"],
    "content": "The BT21 characters have a special place in my heart — they’re simple, round, expressive, and full of charm. But Koya is the one I always come back to.\n\nThe round body + giant ears combo is just TOO cute.\n\nMy favorite part of this make was joining the legs to begin the body. I don’t know why, but those first few stitches joining them together feel like magic — like the moment a character becomes real.\n\nI stitched a tiny sleepy face onto mine and set him next to my desk. Now he watches me work like a tiny guardian of naps.\n\nWant a Koya of your own? Full pattern included in my JSON library!\n\nShare with me: Which BT21 character should I crochet next?"
  }
]
